# CurtainSystemBase Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainSystemBase Class
Members See Also
---
Provides access to the CurtainSystemBase object in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class CurtainSystemBase : HostObject
```

Visual Basic
---
```text
Public Class CurtainSystemBase _
	Inherits HostObject
```

Visual C++
---
```text
public ref class CurtainSystemBase : public HostObject
```

# Remarks
This is the base class of CurtainSystem.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..CurtainSystemBase Autodesk.Revit.DB..::..CurtainSystem
# See Also
CurtainSystemBase Members
Autodesk.Revit.DB Namespace